{
  "version": "https://jsonfeed.org/version/1",
  "title": "Dario Ristic personal website",
  "home_page_url": "http://localhost:3000/",
  "feed_url": "http://localhost:3000/feed.json",
  "description": "Dario Ristic CEO and CO-founder at Cloud Native d.o.o.",
  "date_modified": "2023-10-31T09:42:21+01:00",
  "author": {
    "name": "Dario Ristic ",
    "email": "dario.ristic@gmail.com",
    "url": "http://localhost:3000/"
  },
  "items": [
    {
      "id": "http://localhost:3000/posts/ultimativni-vodic-za-devops-pocetnike/",
      "url": "http://localhost:3000/posts/ultimativni-vodic-za-devops-pocetnike/",
      "title": "Ultimativni vodič za DevOps početnike",
      "content_html": "<header>\n<h1><a href=\"http://localhost:3000/\">Ultimativni vodič za DevOps početnike</a></h1>\n<p><time datetime=\"2021-06-22T00:00:00.000Z\">22.6.2021</time></p>\n</header><section>\n<h2>Za koga je ovaj vodič namenjen?</h2>\n<p>Programerima koji žele da prošire svoje znanje sa operativnim delom ekspertize koja se odnosi na implementaciju, konfigurisanje, održavanje i nadgledanje infrastrukture.</p>\n<p>Sistem administratorima koji žele da unaprede svoje veštine sa poznavanjem celokupnog životnog ciklusa proizvodnje aplikacije, sa znanjem jednog programskog jezika.</p>\n<p>Osobe koje ne spadaju u prethodne dve grupe ali se bave tehnologijom u drugim oblastima u karijeri sa znanjem pisanja koda ili drugih srodnih tehnologija.</p>\n<p>Osobe koje žele da započnu razvoj svoje karijere u pravcu modernih zanimanja danas kao što su DevOps, AIOps i MLOps.</p>\n<h2>Šta je DevOps?</h2>\n<p>Patrick Debois, konsultant za razvoj softvera, zaslužan je za stvaranje termina DevOps kada je 2009. godine, nazvao konferenciju DevOps Days, gde se pozabavio nedostatkom Agile metodologije u načinu razvoja softvera.  Reč DevOps je kombinacija izraza Development i Operations, koji predstavljaju zajednički ili deljeni pristup operativnim zadacima u procesu razvoja softvera koje obavljaju timovi za razvoj softvera i IT operativni timovi zaduženi za infrastrukturu (server, storage, networking) na kojoj se softver pokreće – izvršava.</p>\n<p>U svom najširem značenju, DevOps je filozofija koja promoviše bolju komunikaciju i saradnju između timova – i drugih – u organizaciji. U svom najužem tumačenju, DevOps opisuje usvajanje iterativnog pristupa razvoju softvera, automatizaciju u implementaciji i održavanju infrastrukture. Termin takođe obuhvata i promene u kulturi, poput izgradnje poverenja i kohezije između programera i administratora sistema radi usklađivanja tehnologije  projekata sa poslovnim zahtevima.</p>\n<h2>Kako je nastao DevOps?</h2>\n<p>U tradicionalnom razvoju softvera postojala je jasna podela posla između tima operacija i tima za razvoja softvera. Programeri su bili samo delimično uključeni u rad softvera na kome su radili i znali su vrlo malo o tome gde i kako se pokreće. U međuvremenu, operacije (administratori) su znale vrlo malo o tome šta softver zapravo radi ili o tome kako je kreiran, pa su se samo nadali da će raditi kako se očekuje.</p>\n<p>Ova ideja je suprotstavlja dva tima jedan protiv drugog, jedan sa krajnjim ciljem stabilnosti, drugi sa krajnjim ciljem promena. Izbegavanje konflikata je dovelo do smanjenih unapredjenja aplikacija kroz kreiranje novih verzija i funkcionalnosti kako bi se izbegli prekidi i osigurala stabilnost.</p>\n<p>Ciklusi puštanja novih verzija aplikacija bili su dugi zato što ni operacije ni programeri nisu razumeli jasno podelu odgovornosti prilikom puštanje nove verzije koda. To je značilo da je potrebno mnogo nedjelja i mnogo prekovremenog rada da bi se implementacije uradile pravilno i često je uzrokovalo značajne zastoje. DevOps ima za cilj da to reši uvođenjem kohezivnije saradnje između programera i operativnih inženjera, sa modelom  preklapanja odgovornosti u celom procesu.</p>\n<p>Ideja je da se promene u kodu rade često, idealno i više puta dnevno, sa primenom temeljne automatizacije i testiranja kako bi se smanjili zastoji. U slučajevima bilo kakvih problema omogućen je vrlo brz i lak povratak na prethodnu i stabilnu verziju.</p>\n</section><footer>\n</footer>",
      "date_published": "2021-06-22T02:00:00+02:00",
      "date_modified": "2021-06-22T02:00:00+02:00"
    },
    {
      "id": "http://localhost:3000/posts/koje-vestine-su-potrebne-za-devops/",
      "url": "http://localhost:3000/posts/koje-vestine-su-potrebne-za-devops/",
      "title": "Koje veštine su potrebne za DevOps?",
      "content_html": "<header>\n<h1><a href=\"http://localhost:3000/\">Koje veštine su potrebne za DevOps?</a></h1>\n<p><time datetime=\"2021-05-22T00:00:00.000Z\">22.5.2021</time></p>\n</header><section>\n<p>Teško je ne biti zbunjen kada počnemo da istražujemo odakle da počnemo sa učenjem ove oblasti. Mnogo novih tehnologija se razvija konstantno i nije lako odabrati pravi put ako uzmemo u obzir da lista konstantno raste.</p>\n<h2>Dakle, pitanje je šta prvo naučiti?</h2>\n<p>Podelićemo listu u sledeće kategorije:</p>\n<h2>Osnovne tehničke veštine</h2>\n<p>univerzalno znanje neophodno za sve DevOps pozicije.  Ovo je osnovni preduslov za sve dalje vezano za DevOps. Ovde nema izbora da li želite ili ne želite – jednostavno ovu kategoriju morate da znate.</p>\n<h2>Napredne tehničke veštine</h2>\n<p>alati i procesi koji su vrlo česti u ulogama DevOps -a, ali koje možda ne koristite ili vam nisu potrebni u svakoj ulozi. Svakako je preporuka da ih upoznate i razumete osnovnu logiku.</p>\n<h2>Soft skills: ne tehničke veštine</h2>\n<p>ali veštine koje će vam pomoći u budućnosti razvoja karijere kako da bolje komunicirate sa ljudima na dnevnoj razini.</p>\n<p>Ne možete da naučite napredne veštine DevOps-a ako nemate osnovne tehničke veštine.</p>\n<p>Međutim, ne morate biti vrhunski ekspert za bilo koju od osnovnih veština da biste prešli na DevOps veštine. Ni međuljudske veštine se ne mogu potceniti jer uloga DevOps-a podrazumeva uspostavljanje i održavanje efikasne komunikacije sa svim članovima multifinkcionalnog tima.</p>\n<h2>Šta je od DevOps treninga i kurseva dostupno?</h2>\n<p>Sertifikacija nije neophodna za DevOps poziciju, u praksi kompanije prilikom zapošljavanja više cene praktično znanje i iskustvo nego sertifikaciju. Ali sa druge strane zadavanje ciljeva polaganja određenih ispita i sticanje sertifikata je jako dobar motiv za učenje.</p>\n</section><footer>\nTakođe, ako ne posedujte fakultetsku diplomu ili ste tek završili fakultet polaganje tehničkih ispita je dobar način za građenje kvalitenog CV-ja. U nastavku teksta posle opisa veštine biće predloženi sertifikati za polaganje ispita iz te oblasti. \n</footer>",
      "date_published": "2021-05-22T02:00:00+02:00",
      "date_modified": "2021-05-22T02:00:00+02:00"
    },
    {
      "id": "http://localhost:3000/posts/osnovne-tehnicke-vestine-za-devops/",
      "url": "http://localhost:3000/posts/osnovne-tehnicke-vestine-za-devops/",
      "title": "Osnovne tehničke veštine potrebne za DevOps",
      "content_html": "<header>\n<h1><a href=\"http://localhost:3000/\">Osnovne tehničke veštine potrebne za DevOps</a></h1>\n<p><time datetime=\"2020-07-04T00:00:00.000Z\">4.7.2020</time></p>\n</header><section>\n<p>Teško je ne biti zbunjen kada počnemo da istražujemo odakle da počnemo sa učenjem ove oblasti. Mnogo novih tehnologija se razvija konstantno i nije lako odabrati pravi put ako uzmemo u obzir da lista konstantno raste.</p>\n<h2>Dakle, pitanje je šta prvo naučiti?</h2>\n<p>Ovih šest tehničkih veština zajedničke su svakoj ulozi DevOps-a. Nakon što savladate ove veštine, spremni ste za početak apliciranja za uloge početnog nivoa ili stažiranje dok se krećete lestvicom učenja ka DevOps tehničkim veštinama:</p>\n<ul>\n<li><a href=\"#_Linux\">Linux</a> - fundamentalno</li>\n<li><a href=\"#_Programski_jezik\">Programski jezik</a> - osnovno iskustvo</li>\n<li><a href=\"#_Bash\">Bash</a></li>\n<li><a href=\"#_Git\">Git</a></li>\n<li><a href=\"#_Osnove_mre%C5%BEe\">Mreža</a> - fundamentalno</li>\n<li><a href=\"#_Cloud_Platform\">Public Cloud Platforme</a> - AWS, Azure, GCP - fundamentalno</li>\n</ul>\n<h2>Linux</h2>\n<p>Linux je  operativni sistem (OS) otvorenog koda koji je baziran na Unix-u. Većinu radnog vremena radeći na bilo kojoj DevOps poziciji provodićete u Linux svetu. Naravno i Microsoft ima svoj put baziran na Windows operativnom sistemu koji možete da sledite, ali većina servisa je na otvorenom kodu sa velikom podrškom zajednice i vodećih kompanija poput IBM, Oracle, Google.</p>\n<p>Postoji mnogo resursa koji će vam pomoći u učenju Linux-a on line. Jedan od načina za početak mogao bi biti pregled nastavnog programa <a href=\"https://www.lpi.org/our-certifications/lpic-1-overview\">LPIC ispita</a> i polaganje ispita za dobijanje sertifikata.</p>\n<p>Resursi za učenje:</p>\n<ul>\n<li><a href=\"https://www.tecmint.com/free-online-linux-learning-guide-for-beginners/\">Beginner’s Guide  to Linux</a>​</li>\n<li><a href=\"http://files.catwell.info/misc/mirror/the-unix-programming-environment-kernighan-pike.pdf\">The Unix Programming Environment</a>: Ne morate da znate sve što je u knjizi, ali dobro je da znate kako Linux zapravo radi.</li>\n<li><a href=\"https://doc.lagout.org/operating%20system%20/linux/Unix%20Power%20Tools.pdf\">Unix Power Tools</a> — Velika lista alata koja često dolazi upakovana u različite linux distribucije. Nemojte da vas plaši veličina, koristićete verovatno oko 20% samo.</li>\n<li><a href=\"https://pages.cs.wisc.edu/~remzi/OSTEP/\">Three Easy Pieces</a> - Dobra knjiga koja objašnjava kako OS radi.</li>\n<li><a href=\"https://www.howtogeek.com/412055/37-important-linux-commands-you-should-know/\">List of commonly used commands in Linux</a>​  - Lista korisnih komadi u Linux-u</li>\n<li><a href=\"https://www.tecmint.com/free-online-linux-learning-guide-for-beginners/\">Linux Guide</a>​</li>\n</ul>\n<p>Sertifikacija</p>\n<ul>\n<li><a href=\"https://www.comptia.org/certifications/linux\">Comptia Linux</a>​</li>\n<li><a href=\"https://www.lpi.org/our-certifications/lpic-1-overview\">LPIC I</a>​</li>\n<li><a href=\"https://www.lpi.org/our-certifications/lpic-2-overview\">LPIC II</a>​</li>\n<li><a href=\"https://www.redhat.com/en/services/certification/rhcsa\">RedHat RHCSA</a>​</li>\n</ul>\n<h2>Programski jezik</h2>\n<p>Ne brinite, ne morate biti <a href=\"https://en.wikipedia.org/wiki/Dennis_Ritchie\">Dennis Ritchie</a> da biste postali DevOps inženjer. U stvari, čak ni ne morate sebe nazivati programerom da biste započeli mnoge pozicije u DevOps-u.</p>\n<p>Međutim, morate barem da poznajete osnovne programerske koncepte, kao što su petlje, promenljive, nizovi, liste i itd. To će neće biti samo korisno kada morate da pročitate ili izmenite neki kod, već biti od suštinskog značaja i prilikom pisanja skripti, yaml fajlova i automatizacije procesa.</p>\n<p>Savetujemo da počnete sa Python-om naučite osnove, a zatim napravite nalog na platformi poput <a href=\"https://edabit.com/\">Edabita</a> i pređite na srednji nivo. Ako dođete do tog nivoa, ne biste trebali imati velikih problema u pisanju skripti i obavljanju većine poslova automatizacije koji vam se nađu. Takođe, u nekom trenutku vašeg učenja, vredi se upoznati sa uobičajenim obrascima dizajna i algoritmima. Ovo nije neophodno za početak rada u DevOps -u, ali će vam dobro doći.</p>\n<p>Resursi za učenje</p>\n<ul>\n<li><a href=\"https://www.codecademy.com/learn/learn-how-to-code/modules/bop-i\">Codecademy basics of programming</a>​</li>\n<li><a href=\"https://www.learnpython.org/\">Python Free Interactive Tutorial</a>​</li>\n<li><a href=\"https://edabit.com/challenges/python3\">Edabit</a> - Sajt na kome dobijate programerske izazove.</li>\n<li><a href=\"https://www.hackerrank.com/domains/python?filters%5Bsubdomains%5D%5B%5D=py-introduction\">Hackerrank</a></li>\n<li><a href=\"https://u.osu.edu/cstutorials/2016/11/21/7-algorithms-and-data-structures-every-programmer-must-know/\">Common Algorithms</a>​</li>\n<li><a href=\"https://refactoring.guru/design-patterns/catalog\">Design Patterns</a>​</li>\n</ul>\n<p>Sertifikacija</p>\n<ul>\n<li><a href=\"https://pythoninstitute.org/certification/\">Python Sertifikacija</a>​</li>\n</ul>\n<h2>Bash</h2>\n<p>Bash je najvažniji skriptini jezik za automatizaciju zadataka u Unix okruženju (Powershell bi bio ekvivalent za Windows). Čak i ako više volite skriptovanje na Python-u ili bilo kojem drugom jeziku, bash je najrasprostranjeniji i bit će vam jako teško raditi ovaj posao bez znanja kako ga koristiti.</p>\n<p>Ne morate biti čudo od programera da biste postigli većinu zadataka sa kojima ćete se svakodnevno susretati, ali određeno osnovno znanje programiranja definitivno pomaže.</p>\n<p>Resursi za učenje</p>\n<ul>\n<li><a href=\"https://www.tldp.org/LDP/Bash-Beginners-Guide/html/\">Beginner Bash Guide</a>​</li>\n<li><a href=\"https://tldp.org/LDP/abs/html/\">Advance Scripting Guide</a>​</li>\n<li><a href=\"https://www.learnshell.org/\">Bash interactive tutorial</a>​</li>\n<li><a href=\"https://cmdchallenge.com/\">Bash Interactive Challenges</a>​</li>\n<li><a href=\"https://guide.bash.academy/\">The Bash Guide</a>​</li>\n<li><a href=\"https://www.katacoda.com/courses/linux\">Bash Katacoda</a>​</li>\n<li><a href=\"http://index-of.es/Programming/Bash/O%27Reilly%20bash%20CookBook.pdf\">Bash Cookbook</a>​</li>\n</ul>\n<h2>Osnove mreže</h2>\n<p>Danas je većina infrastrukture bazirana na javnim cloud provajderima ili Kubernetes klasterima koji se nalaze na lokacijama korisnika. Da bi uspešno kreirali infrastrukturu potrebno je da imate osnovno znanje o mrežnim pojmovima. Ne očekuje se da ste nekada bili mrežni inženjer ali da znate odgovore na ova dole pitanja je poželjno.</p>\n<ul>\n<li>Šta je ip adresa?</li>\n<li>Šta je subnet i subnet mask?</li>\n<li>Šta je ruta?</li>\n<li>Šta je ruter a šta je switch?</li>\n<li>Šta je VPC?</li>\n</ul>\n<p>Učenje gore navedenog je od suštinskog  značaja za rešavanje problema i kasnije dizajniranjem VPC strategije u infrastrukturi.</p>\n<p>Resursi za učenje</p>\n<ul>\n<li><a href=\"https://www.coursera.org/learn/computer-networking\">The Bits and Bytes of Computer Networking</a>​</li>\n<li><a href=\"https://www.udemy.com/course/complete-networking-fundamentals-course-ccna-start/\">Udemy Networking Course</a>​</li>\n</ul>\n<p>Sertifikacija</p>\n<ul>\n<li><a href=\"https://www.comptia.org/certifications/network\">Comptia Network</a>​</li>\n</ul>\n<h2>Git</h2>\n<p>Git je distribuirani sistem kontrole verzija koda. Omogućava nam praćenje promena u kodu od strane tima koji zajednički sarađuje na projektu. Koriste ga svi softverski inženjering i operativni timovi. Toplo vam preporučujemo da provedete neko vreme upoznajući se sa njim i pojmovima branches, rebase, merging, itd.</p>\n<p>Resursi za učenje</p>\n<ul>\n<li><a href=\"https://rogerdudler.github.io/git-guide/\">git — the simple guide</a>​</li>\n<li><a href=\"https://learngitbranching.js.org/\">Learn git Branching</a> — interactive course with challenges.</li>\n<li><a href=\"https://www.katacoda.com/courses/git\">Katacoda Interactive git</a>​</li>\n<li><a href=\"https://cloud.google.com/architecture/devops/devops-tech-version-control\">Version Control</a>​</li>\n</ul>\n<h2>Cloud Platform</h2>\n<p>Postoji nekoliko javni cloud platformi koje možete izabrati za početak. Tri najveća su AWS, GCP i Azure. Većina počinje sa AWS-om jer se on često traži u oglasima za posao. Google - GCP  je intuitivan i jednostavan za upotrebu. Takođe dobijate 300 dolara besplatnog kredita za početak. Azure je takođe dobar izbor ako više volite da radite na Microsoft okruženju i tu želite da vaša karijera ide.</p>\n<p>Resursi za učenje</p>\n<ul>\n<li><a href=\"https://cloud.google.com/free\">Google Cloud Free Offering</a>​</li>\n<li><a href=\"https://google.qwiklabs.com/\">Quicklabs</a>​</li>\n<li>Azure</li>\n<li><a href=\"https://aws.amazon.com/free/?all-free-tier.sort-by=item.additionalFields.SortRank&amp;all-free-tier.sort-order=asc\">AWS Free Tier</a>​</li>\n<li><a href=\"https://www.coursera.org/googlecloud\">Google Cloud Free Courses</a>​</li>\n<li><a href=\"https://www.coursera.org/courses?query=aws\">AWS and other Cloud Computing Agnostic Free Courses</a>​</li>\n</ul>\n<p>Sertifikacija</p>\n<ul>\n<li><a href=\"https://cloud.google.com/certification/cloud-digital-leader\">Cloud Digital Leader GCP certification</a>​</li>\n<li><a href=\"https://cloud.google.com/certification/cloud-engineer\">GCP Associate Cloud Engineer</a>​</li>\n<li><a href=\"https://aws.amazon.com/certification/certified-cloud-practitioner/?ch=cta&amp;cta=header&amp;p=2\">AWS Certified Cloud Practitioner</a>​</li>\n<li><a href=\"https://docs.microsoft.com/en-us/learn/certifications/azure-fundamentals/\">Azure Fundamentals</a>​</li>\n<li><a href=\"https://cloud.google.com/certification/cloud-network-engineer\">GCP Cloud Network Engineer</a>​</li>\n</ul>\n</section><footer>\nTakođe, ako ne posedujte fakultetsku diplomu ili ste tek završili fakultet polaganje tehničkih ispita je dobar način za građenje kvalitenog CV-ja. U nastavku teksta posle opisa veštine biće predloženi sertifikati za polaganje ispita iz te oblasti. \n</footer>",
      "date_published": "2020-07-04T02:00:00+02:00",
      "date_modified": "2020-07-04T02:00:00+02:00"
    },
    {
      "id": "http://localhost:3000/posts/napredne-tehnicke-vestine-za-devops/",
      "url": "http://localhost:3000/posts/napredne-tehnicke-vestine-za-devops/",
      "title": "Napredne tehničke veštine potrebne za DevOps",
      "content_html": "<header>\n<h1><a href=\"http://localhost:3000/\">Napredne tehničke veštine potrebne za DevOps</a></h1>\n<p><time datetime=\"2020-04-22T00:00:00.000Z\">22.4.2020</time></p>\n</header><section>\n<p>Kada steknete osnovne tehničke veštine, možete nastaviti sa upoznavanjem sa alatima i praksama koje se posebno koriste u ulogama DevOps-a. Ovo ni u kom slučaju nije iscrpna lista, ali to su najčešće veštine i teme sa kojima ćete se najverovatnije susresti u većini uloga DevOps -a:</p>\n<p>·      <a href=\"#_Kontejneri\">Kontejneri</a><br>\n·      <a href=\"#_Continuous_Integration_(CI)\">CI/CD Continuous Deployment</a><br>\n·      <a href=\"#_Infrastructure_as_Code\">Infrastructure as Code (IaC)</a><br>\n·      <a href=\"#_Mikroservisna_Arhitektura\">Mikroservisna Arhitektura</a><br>\n·      <a href=\"#_Kontejnerski_orkestratori\">Kontejnerski orkestratori</a><br>\n·      <a href=\"#_Monitoring\">Monitoring</a><br>\n·      <a href=\"#_Software_Reliability_Engineering\">Software Reliability Engineering (SRE)</a><br>\n·      <a href=\"#monitoring\">Bezbednost</a></p>\n<h1>Kontejneri</h1>\n<p>Tehnologija koja je zvanično postala standard od 2013. god., ali je prisutna mnogo duže kroz Unix Freebsd jail koncept, kada je privi put predstavljena mogućnost hostovanja više particija na jednom sistemu. Kasnije je ovaj koncept usavršavan kroz OpenVZ i Solaris projekte da bih sa pojavom Docker-a postao standard u DevOps poslu. Kontejnerizacija je metoda pakovanja aplikacija sa svim potrebnim fajlovima na lagan i jednostavan način koji ima za cilj da aplikacija koja je spakovana radi u bilo kom okruženju. Kada se kaže okruženje misli se na developer laptop ili public cloud k8s.</p>\n<p>Kontejneri se često koriste u arhitekturi mikroservisa, pa je razumevanje kontejnera neophodno za rad sa developerima. Kontejnerski orkestratori se takođe često koriste ovih dana, što ćemo kasnije opisati.</p>\n<p>Alati</p>\n<ul>\n<li><a href=\"https://docs.docker.com/get-started/\">Docker</a> - Standardno okruženje za kontejnere koje morate da naučite</li>\n<li><a href=\"https://docs.docker.com/compose/\">Docker-compose</a> - This tool allows you to configure and orchestrate multiple containers in your computer, especially useful if your application has multiple containers or if you need to bring up the same container over and over.</li>\n<li><a href=\"https://www.pluralsight.com/courses/docker-deep-dive-update\">Docker Deep Dive</a> - A fantastic and thorough course from the 5-star training instructor</li>\n</ul>\n<p>Sertifikacija</p>\n<ul>\n<li><a href=\"https://acloudguru.com/course/docker-certified-associate-dca\">Docker Certified Associate</a>​</li>\n</ul>\n<p>Resursi za učenje</p>\n<ul>\n<li><a href=\"https://training.play-with-docker.com/\">Play with Docker</a>​</li>\n<li><a href=\"https://www.tutorialspoint.com/docker/docker_compose.htm\">Docker-compose mini tutorial</a>​</li>\n<li><a href=\"https://www.docker.com/sites/default/files/d8/2019-09/docker-cheat-sheet.pdf\">Docker cheatsheet</a>​</li>\n<li><a href=\"https://devhints.io/docker-compose\">Docker-compose cheatsheet</a>​</li>\n</ul>\n<p>Continuous Integration (CI) - Continuous Delivery (CD) - Continuous Deployment</p>\n<p>CI/CD pipeline možemo posmatrati kao proizvodnu liniju u kompaniji koja se bavi softverskim inženjeringom. CI pipeline spaja i testira kod kako bi se osiguralo da je kod spreman za integraciju u glavnu granu - branch, a CD pipeline je njegovo proširenje kako bi se osigurali uslovi za pokretanje na infrastrukturi.</p>\n<p>Dobro razumevanje CI/CD-a zahteva razumevanje git-a, git-branching grananja, različite tipove automatizacije i različite metoda testiranja. Jenkins je najkorišćeniji CI alat i bilo bi dobro da ga naučite. Međutim, nije user friendly za korisnike, a jezik koji se koristi za pisanje pipeline (Groovi) nije baš intuitivan. Gitlab CI je mnogo jednostavniji za upotrebu i mogao bi biti pristupačniji alat za prvo učenje pipelina. Postoji mnogo drugih alata koje možete koristiti za brigu o svojim CI/CD pipeline-ima, ali najvažnije je da ste upoznati sa konceptom.</p>\n<p>Pre učenja CI/CD -a, preporučuje se da naučite Trunk Based Development (TBD) i kako se on upoređuje sa drugim modelima grananja.</p>\n<p>Alati</p>\n<ul>\n<li><a href=\"https://www.jenkins.io/\">Jenkins</a>​</li>\n<li><a href=\"https://docs.gitlab.com/ee/ci/\">Gitlab CI</a>​</li>\n</ul>\n<p>Resursi za učenje</p>\n<ul>\n<li><a href=\"https://medium.com/contino-engineering/branching-models-in-a-nutshell-bf24ea1d888a\">Branching Models</a>​</li>\n<li><a href=\"https://medium.com/contino-engineering/git-to-know-this-before-you-do-trunk-based-development-tbd-476bc8a7c22f\">Git tutorial for TBD</a>​</li>\n<li><a href=\"https://youtube.com/playlist?list=PLwLLcwQlnXBxy8H8JEizOcfDh_Vyy6qyv\">Continuous Delivery Playlist by Dave Farley</a>​</li>\n<li><a href=\"https://www.amazon.co.uk/Continuous-Delivery-Deployment-Automation-Addison-Wesley/dp/0321601912\">Continuous Delivery Book</a>​</li>\n<li><a href=\"https://www.redhat.com/en/topics/devops/what-is-continuous-delivery\">What is continuous delivery?</a>​</li>\n<li><a href=\"https://cloud.google.com/architecture/devops/devops-tech-trunk-based-development\">Learning TBD</a>​</li>\n<li><a href=\"https://cloud.google.com/architecture/devops/devops-tech-continuous-integration\">Continuous Integration</a>​</li>\n<li><a href=\"https://cloud.google.com/architecture/devops/devops-tech-deployment-automation\">Deployment Automation</a>​</li>\n<li><a href=\"https://cloud.google.com/architecture/devops/devops-tech-test-automation\">Continuous Testing</a>​</li>\n<li><a href=\"https://cloud.google.com/architecture/devops/devops-tech-continuous-delivery\">Continuous Delivery</a>​</li>\n<li><a href=\"https://trunkbaseddevelopment.com/\">Trunk Based Development (TBD)</a>​</li>\n<li><a href=\"https://en.wikipedia.org/wiki/Test-driven_development\">Test Driven Development</a></li>\n<li><a href=\"https://youtu.be/IvWr29afDF8\">Continuous Delivery, it’s great but it won’t work here</a></li>\n<li><a href=\"https://youtu.be/6DeWOrmvhRM\">Adopting Continuous Delivery</a></li>\n</ul>\n<h2>Infrastructure as Code (IaC)</h2>\n<p>Infrastructure as code - je tehnologija koja vam omogućava da kreirate, konfigurišete i održavate infrastrukturne resurse pisanjem i primenom kod-a. Neko će reći da je ceo DevOps pisanje YAML fajlova .</p>\n<p>Ovo je potpuno drugačiji pristup od toga da ručno unosite komande u konzoli, zato što imate mogućnost da zadržite vaše fajlove, da ih modifikujte, unapredite i replicirate svaki put kada vam je to potrebno.</p>\n<p>Configuration Management (CM) je automatizacija instalirane infrastrukture. Na primer, pokreni skriptu koja će izvršiti update na nekoliko servera odjednom i vratiti vam rezultat. Alati kao što su Ansible, Puppet, Saltstack and Chef omogućavaju da ovo uradite na jednostavan i brz način.</p>\n<p>Alati</p>\n<ul>\n<li><a href=\"https://www.terraform.io/\">Terraform</a> (Orchestration)</li>\n<li><a href=\"https://aws.amazon.com/cloudformation/\">CloudFormation</a> (Orchestration for AWS only)</li>\n<li><a href=\"https://www.ansible.com/resources/get-started\">Ansible</a> (CM)</li>\n<li><a href=\"https://www.packer.io/\">Packer</a> - za kreiranje Image</li>\n<li><a href=\"https://cloud.google.com/deployment-manager/docs\">Cloud Deployment Manager</a> (Orchestration for GCP only)</li>\n</ul>\n<p>Resursi za učenje</p>\n<ul>\n<li><a href=\"https://learn.hashicorp.com/tutorials/terraform/infrastructure-as-code\">Learn IaC with Terraform</a>​</li>\n<li><a href=\"https://www.invensislearning.com/blog/infrastructure-as-a-code-tutorial/\">IaC tutorial</a>​</li>\n<li><a href=\"https://www.digitalocean.com/community/conceptual_articles/infrastructure-as-code-explained\">IaC Explained</a>​</li>\n<li><a href=\"https://www.ansible.com/overview/how-ansible-works\">How Ansible works</a>​</li>\n</ul>\n<p>Sertifikacija</p>\n<ul>\n<li><a href=\"https://www.hashicorp.com/certification/terraform-associate\">Terraform Certification</a>​</li>\n</ul>\n<h2>Mikroservisna Arhitektura</h2>\n<p>Tradicionalno, aplikacije se prave kao monolitna formacija, što zapravo znači da su sve komponente aplikacije integrisane zajedno i rade na istom serveru. Monolitni pristup je opšteprihvaćen i jednostavan za početak rada na novoj aplikaciji, problemi dolaze kasnije kada veličina koda postane velika i kada je potrebno da se rade izmene i unapređenja. Komplikovan i kompleksan sistem baziran na monolitu je jako zahtevan za održavanje i unapređenje.</p>\n<p>Kako bih prevazišli ovaj problem sa danas dostupnom tehnologijom sve više se okrećemo mikroservisnoj arhitekturu aplikacija, gde su se trudimo da pravimo samo neophodne veze između komponenti nekog sistema.</p>\n<p>Mikroservisna arhitektura ima nekoliko prednosti u odnosu na monolitnu arhitekturu</p>\n<ul>\n<li>Lakše je distribuirati odgovornosti i dužnosti</li>\n<li>Svaki tim radi na svom mikroservisu koji je jedna komponenta sistema</li>\n<li>Lakše je nezavisno skalirati opterećenje</li>\n<li>Bolja izolacije u slučaju greške, ako jedan servis stane ne staje ceo sistem</li>\n<li>Bolja izolacije podataka u slučaju GDPR-a i sličnih slučajeva</li>\n<li>Lakše je unapređenje servisa bez rizika da ceo sistem prestane da radi</li>\n</ul>\n<p>Mikroservisi nisu integralni deo svake DevOps role, ali pošto se jako blisko naslanja na ostale koncepte DevOps-a: kontejnere i orkestraciju dobro je da se razume ovaj pristup arhitekturi.</p>\n<p>Kada je reč o tome, mikroservisi nisu nešto što nas rešava svih muka u budućnosti; omogućavaju veću fleksibilnost i skalabilnost ali su takođe daleko složeniji u aspektu infrastrukture i hardverskog okruženja koje može da osigura sve potrebne servise. U suštini trgujete kompleksnošću koda za infrastrukturnu kompleksnost sa ciljem da poboljšate brzinu razvoja i skalabilnost.</p>\n<p>Budući da su mikroservisi mala pakovanja u kontejnere, orkestratori su često poželjna metoda za pokretanje. Sloj inteligencije koju poseduje orkestrator će se pobrinuti za to da vaš kontejner bude adekvatno smešten na klaster i ponovo pokrenut ako postoji problem.</p>\n<p>Važno je da razumete kakva aplikacija treba da bude da bi se kvalifikovala za mikroservis. Jednostavno prevlačenje monolitne aplikacije sa servera i bacanje u kontejnere neće je učiniti mikroservisom. Umesto toga, svaku komponentu je potrebno podeliti i redizajnirati tako da je minimalno povezana i zavisna od ostalih komponenti sistema.</p>\n<p>Takođe, za mikroservise je potreban zaokret u načinu na koji se infrastruktura tradicionalno posmatra. Umesto da servere tretiramo kao kućne ljubimce, oni se tretiraju kao stoka.<a href=\"#_msocom_1\">[ŽP1]</a></p>\n<p>Resursi</p>\n<ul>\n<li><a href=\"https://youtu.be/zzMLg3Ys5vI\">The Problem with Microservices</a>​</li>\n<li><a href=\"https://12factor.net/\">12 Factor Application</a></li>\n<li><a href=\"https://youtu.be/GBTdnfD6s5Q\">When to use Microservices and when not to</a>.</li>\n<li><a href=\"https://youtube.com/playlist?list=PLdsOZAx8I5umhnn5LLTNJbFgwA3xbycar\">Software Architecture Monday</a></li>\n<li><a href=\"https://nandovillalba.medium.com/essential-microservice-testing-a838c34a86e3\">Essential Microservice Testing</a>​</li>\n<li><a href=\"https://learn.particular.net/courses/distributed-systems-design-fundamentals-online\">Advance Distributed System Design</a>​</li>\n<li><a href=\"https://youtu.be/CZ3wIuvmHeM\">Mastering Chaos, a Netflix Guide to Microservices.</a>​</li>\n<li><a href=\"https://microservices.io/patterns/microservices.html\">Microservice Pattern</a>​</li>\n</ul>\n<h2>Kontejnerski orkestratori</h2>\n<p>Kontejnerski orkestratori vam omogućavaju da pokrenete kontejnere na jednom ili više servera i horizontalno skalirate opterećenje. To ih čini idealnim platformama za pokretanje mikroservisa.</p>\n<p>Na primer, umesto da jedan ili više kontejnera rade na jednom serveru, orkestrator će se pobrinuti za kreiranje više replika servera i kontejnera kako bi omogućio najbolje performanse prilikom većeg opterećenja.</p>\n<p>Zvuči dovoljno jednostavno ali orkestratori prave određene pretpostavke o tome kako je vaša aplikacija dizajnirana. Na primer, pretpostavljaju da se konfiguracija prosleđuje kao promenljiva okruženja i da se podaci ne čuvaju u stvarnom kontejneru. Tako da ponekad migriranje aplikacije orkestratoru da bi bila skalabilna zahteva ponovno reinženjering da bi bila mikroservis. Metodologija <a href=\"https://12factor.net/\">12 Factor</a> je metod dizajnirana aplikacija koji ih čini idealnim za rad sa orkestratorima.</p>\n<p>Iako ima mnogo orkestara kao što su Swarm, ECS i Nomad, ubedljivo najpopularniji kontejnerski orkestar je Kubernetes i zato vam preporučujemo da usredsredite svoje napore na Kubernetes.</p>\n<p>Kada učite Kubernetes, preporučujemo pristup od vrha nadole. Počnite sa površnim razumevanjem arhitekture i komponenti, a zatim se igrajte sa već postojećim klasterom, umesto da kreirate sopstveni od početka. To će učiniti vaš proces učenja mnogo manje komplikovanim i takođe će vam olakšati da vidite zašto su sve komponente potrebne.</p>\n<p>Alati</p>\n<ul>\n<li><a href=\"https://www.docker.com/products/kubernetes\">Docker Kubernetes</a>​</li>\n<li><a href=\"https://kind.sigs.k8s.io/docs/user/quick-start/\">Kind</a>​</li>\n<li><a href=\"https://cloud.google.com/kubernetes-engine\">GKE</a>​</li>\n<li><a href=\"https://aws.amazon.com/eks/?whats-new-cards.sort-by=item.additionalFields.postDateTime&amp;whats-new-cards.sort-order=desc&amp;eks-blogs.sort-by=item.additionalFields.createdDate&amp;eks-blogs.sort-order=desc\">EKS</a>​</li>\n<li><a href=\"https://azure.microsoft.com/en-gb/services/kubernetes-service/\">AKS</a>​</li>\n<li><a href=\"https://github.com/derailed/k9s\">K9s</a>​</li>\n<li><a href=\"https://k0sproject.io/\">k0s</a>​</li>\n</ul>\n<p>Resursi</p>\n<ul>\n<li><a href=\"https://youtu.be/X48VuDVv0do\">Kubernetes Tutorial for beginners</a>​</li>\n<li><a href=\"https://kubernetes.io/docs/concepts/overview/components/\">Kubernetes Components</a>​</li>\n<li><a href=\"https://medium.com/bb-tutorials-and-thoughts/practice-enough-with-these-questions-for-the-ckad-exam-2f42d1228552\">CKAD Practice Questions</a>​</li>\n<li><a href=\"https://github.com/walidshaari/Kubernetes-Certified-Administrator\">CKA learning Resursi za učenje</a>​</li>\n<li><a href=\"https://github.com/kelseyhightower/kubernetes-the-hard-way\">Learning Kubernetes the Hard Way</a>​</li>\n</ul>\n<p>Sertifikacija</p>\n<ul>\n<li><a href=\"https://www.cncf.io/certification/cka/\">Certified Kubernetes Administrator</a>​</li>\n</ul>\n<h2>Monitoring</h2>\n<p>Pratimo sisteme koji nam govore kada je nešto problem ili će biti problem i posmatramo da osiguramo sigurne performanse i saobraćaj koji nam pomažu da u budućnosti učinimo naše sisteme boljim.  Praćenje se radi o razumevanju poznatih i poznatih nepoznanica, uz praćenje testirate hipoteze o ponašanju sistema. Sa druge strane, primetnost je o nepoznatim osobama; o otkrivanju novih problema sa bogatijim podacima i stvaranju hipoteza koje se mogu pratiti.</p>\n<p>Praćenje i posmatranje se može svesti na:</p>\n<p>Evidentiranje: Proces izlaznih sistemskih događaja koji mogu, ali i ne moraju biti greške.</p>\n<p>Metrika: To su vremenske serije koje ukazuju na broj događaja u vremenskom periodu. Mogu se zasnivati na evidencijama ili statusu sistema kao što je RAM itd.</p>\n<p>Distribuirano praćenje: Sa distribuiranom praćenjem dodeljujete pojedinačni ID svakom zahtevu koji dođe u sistem kako biste mogli da pratite njegov put kroz njega i kako je to uticalo na različite mikroservise.</p>\n<p>Indikatori nivoa usluga (SLI)****:** Oni odražavaju trenutno stanje vašeg sistema. SI se obično zasniva na metrikama koje definišete.</p>\n<p>Ciljevi nivoa usluge (SLO)****:** Definišete SLO i osiguravate da se vaš sistem pokreće ispod te metrike. Na primer, ako imate SLO da 95% zahteva treba da bude ispod 200ms i odjednom počnete da vidite previše zahteva u sekundi, onda kršite svoje SLO-ove. Kada se to desi moraćete da dizajnirati za razmeru ili da rešite problem koji uzrokuje ove pikove u performansama da ne biste izgubili korisnike.</p>\n<p>Ugovori o nivou usluga (SLA)** : Ugovori o nivou usluge su ugovori koje imate sa klijentima koji navode kakva će naknada biti data ako se prekrše. Na primer, kupcima biste mogli da kažete da ako vam usluga ne radi više od 95% godišnje platićete im x iznosa novca u kreditima. SLA treba postaviti daleko više od SLO-a, na ovaj način možete da se uhvatite u koštac sa tim pitanjem pre nego što vaši nivoi budu kritični.</p>\n<p>Resursi za učenje</p>\n<ul>\n<li><a href=\"https://www.atlassian.com/incident-management/kpis/sla-vs-slo-vs-sli\">SLIs vs SLOs vs SLAs</a>​</li>\n<li><a href=\"https://cloud.google.com/architecture/devops/devops-measurement-monitoring-and-observability\">Monitoring and observability</a>​</li>\n<li><a href=\"https://sre.google/workbook/monitoring/\">Monitoring</a>​</li>\n<li><a href=\"https://sre.google/sre-book/practical-alerting/\">Practical Alerting</a>​</li>\n<li><a href=\"https://sre.google/sre-book/service-level-objectives/\">Service Level Objectives</a>​</li>\n<li><a href=\"https://sre.google/workbook/implementing-slos/\">Implementing SLOs</a>​</li>\n<li><a href=\"https://sre.google/workbook/alerting-on-slos/\">Alerting on SLOs</a>​</li>\n<li><a href=\"https://www.scalyr.com/blog/the-10-commandments-of-logging/\">Logging Best Practices</a>​</li>\n<li><a href=\"https://dzone.com/articles/microservice-observability-part-1-disambiguating-o\">Microservice Observability</a>​</li>\n<li><a href=\"https://microservices.io/patterns/observability/distributed-tracing.html\">Distributed Tracing</a>​</li>\n</ul>\n</section><footer>\nTakođe, ako ne posedujte fakultetsku diplomu ili ste tek završili fakultet polaganje tehničkih ispita je dobar način za građenje kvalitenog CV-ja. U nastavku teksta posle opisa veštine biće predloženi sertifikati za polaganje ispita iz te oblasti. \n</footer>",
      "date_published": "2020-04-22T02:00:00+02:00",
      "date_modified": "2020-04-22T02:00:00+02:00"
    },
    {
      "id": "http://localhost:3000/posts/sta-je-devops-inzenjer/",
      "url": "http://localhost:3000/posts/sta-je-devops-inzenjer/",
      "title": "Šta je DevOps inženjer - opis posla na poziciji DevOps",
      "content_html": "<header>\n<h1><a href=\"http://localhost:3000/\">Šta je DevOps inženjer - opis posla na poziciji DevOps</a></h1>\n<p><time datetime=\"2017-10-05T00:00:00.000Z\">5.10.2017</time></p>\n</header><section>\n<h1>Šta je zapravo posao DevOps inženjera?</h1>\n<p>Opis posla DevOps inženjer se mnogo razlikuje u zavisnosti od tipa poslovne organizacije. Različiti su pristupi kod projektno orjentisani kompaniju u odnosu na produktno orjentisane kompanije.</p>\n<p>Postoji mišljenje da titula DevOps inženjera ne bi trebalo da postoji, jer je DevOps „kultura i filozofija“ odnosno „način rada i razmišljanja“ – a ne uloga ili pozicija.</p>\n<p>Ovo nas navodi na  zaključak da postoji sloboda u dubini znanja DevOps pozicije u različitom poslovnom okruženju i zavisnosti od potreba organizacije.</p>\n<p>Često se u zadnje vreme spominje teorija da stvaranje dodatnog DevOps silos tima poništava svrhu preklapanja odgovornosti i zajedničkog rada različitih timova što je suština DevOps-a.</p>\n<p>Organizacije koje dobro razumeju ovu metodologiju nemaju DevOps pozicije. One rade na stavljanju fokusa na uske specijalizacije u određenim oblastima na pozicijama: inženjera infrastrukture, inženjera za pouzdanost sistema (SRE), CI/CD inženjera, sistem administratora.</p>\n<p>Jedina stvar koja je sigurna je da DevOps inženjer mora dobro razumeti kulturu i praksu DevOps-a i trebao bi biti u mogućnosti da premosti sve nedostatke u komunikaciji između ostalih članova tima.</p>\n<p>Iako je DevOps izraz koji može obuhvatiti mnoge uloge, postoje neki zajednički zadaci u ovim različitim ulogama:</p>\n<ul>\n<li>Dizajn i implementacija CI/CD procesa</li>\n<li>Automatska izgradnja i konfiguracija infrastrukture</li>\n<li>Instalacija, konfiguracija i održavanje orkestratora kontejnera</li>\n<li>Bliska saradnja sa programerima na polju dizajna novih servisa</li>\n<li>Dizajniranje platformi za nadgledanje i praćenje</li>\n<li>Pružanje servisa održavanja platforme</li>\n<li>Obezbedjivanje sigurnosti infrastrukture</li>\n</ul>\n</section><footer>\n<p>Potrebno je malo planiranja i dokumentacije, ali solidna strategija A/B testiranja će vam uštedeti mnogo vremena i povećati vašu profitabilnost na duže staze.</p>\n</footer>",
      "date_published": "2017-10-05T02:00:00+02:00",
      "date_modified": "2017-10-05T02:00:00+02:00"
    }
  ]
}